from scapy.all import *


def check_open_ports(target ):
    portsmass = []
    # Укажите диапазон портов, которые вы хотите просканировать
    ports = range(1, 1025)  # Сканирование портов с 1 по 1024

    # Создайте функцию для сканирования портов
    def scan_port(target, port):
        response = sr1(IP(dst=target) / TCP(dport=port, flags="S"), timeout=1, verbose=0)
        if response and response.haslayer(TCP) and response[TCP].flags & 2:
            print(f"Порт {port} открыт")
            portsmass.append({"text": f"Порт {port} открыт"})
    # Выполните сканирование портов
    for port in ports:
        scan_port(target, port)